src/test/resources/uk/nhs/ciao/transport/spine/ebxml/test-manifest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:hl7ebxml="urn:hl7-org:transport/ebxml/DSTUv1.0"
	xmlns:xlink="http://www.w3.org/1999/xlink">
	<soap:Header>
		<eb:MessageHeader eb:version="2.0" soap:mustUnderstand="1">
			<eb:From>
				<eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">BBB-654321</eb:PartyId>
			</eb:From>
			<eb:To>
				<eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">AAA-123456</eb:PartyId>
			</eb:To>
			<eb:CPAId>S3024519A3110234</eb:CPAId>
			<eb:ConversationId>5F21C7C0-6CD2-4A50-A879-F3241BA7BE29</eb:ConversationId>
			<eb:Service>urn:oasis:names:tc:ebxml-msg:service</eb:Service>
			<eb:Action>QWERTY</eb:Action>
			<eb:MessageData>
				<eb:MessageId>F5FECB6E-E891-4381-94AA-E5106A990B04</eb:MessageId>
				<eb:Timestamp>2015-06-03T08:27:36</eb:Timestamp>
			</eb:MessageData>
		</eb:MessageHeader>

	</soap:Header>
	<soap:Body>
		<eb:Manifest eb:version="2.0">
			<eb:Reference xlink:href="cid:3c3f6c55-5cd5-4be8-96db-e918ef188997">
				<eb:Schema eb:location="http://www.nhsia.nhs.uk/schemas/HL7-Message.xsd" eb:version="1.0"/>
				<eb:Description xml:lang="en">HL7 payload</eb:Description>
				<hl7ebxml:Payload style="HL7" encoding="XML" version="3.0"/>
			</eb:Reference>
			<eb:Reference xlink:href="cid:f7c41ce6-0289-4ddd-bf43-95df37c1dfec">
				<eb:Description xml:lang="en">ITK Trunk Message</eb:Description>
			</eb:Reference>
	</eb:Manifest>
	</soap:Body>
</soap:Envelope>
